app/Controllers/Productos.php

SELECT *
FROM `productos`
WHERE `activo` = 1
---
    public function index($activo = 1)
    {
        $productos = $this->productos->where('activo',$activo)->findAll();

SELECT *
FROM `unidades`
WHERE `activo` = 1
SELECT *
FROM `categorias`
WHERE `activo` = 1
---
    public function nuevo()
    {

        $unidades = $this->unidades->where('activo', 1)->findAll();
        $categorias = $this->categorias->where('activo', 1)->findAll();