app/Controllers/Unidades.php

    public function index($activo = 1)
    {
        $unidades = $this->unidades->where('activo',$activo)->findAll();
---
SELECT *
FROM `unidades`
WHERE `activo` = 1